## Staging: database
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 1 to add, 1 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                   NAME                   |
|--------|------------------------------------------|
| add    | `aws_ssm_parameter.docdb_uri`            |
| update | `aws_security_group.ai-answers-docdb-sg` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_security_group.ai-answers-docdb-sg will be updated in-place
  ~ resource "aws_security_group" "ai-answers-docdb-sg" {
        id                     = "sg-04966047bf236b850"
      ~ ingress                = [
          - {
              - cidr_blocks      = [
                  - "10.0.0.0/16",
                ]
              - from_port        = 27017
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 27017
                # (1 unchanged attribute hidden)
            },
          - {
              - cidr_blocks      = []
              - description      = "Allow DocumentDB cluster to receive requests from ECS"
              - from_port        = 27017
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-085c606383f33733e",
                ]
              - self             = false
              - to_port          = 27017
            },
          + {
              + cidr_blocks      = [
                  + "10.0.0.0/16",
                ]
              + from_port        = 27017
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 27017
            },
        ]
        name                   = "ai-answers-example-docdb-sg"
        tags                   = {
            "CostCentre" = "ai-answers-staging"
            "Terraform"  = "true"
        }
        # (8 unchanged attributes hidden)
    }

  # aws_ssm_parameter.docdb_uri will be created
  + resource "aws_ssm_parameter" "docdb_uri" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "docdb_uri"
      + tags_all       = {
          + "CostCentre" = "ai-answers-staging"
          + "Terraform"  = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

Plan: 1 to add, 1 to change, 0 to destroy.

Changes to Outputs:
  + docdb_uri_arn               = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_ssm_parameter.docdb_uri"]

20 tests, 19 passed, 1 warning, 0 failures, 0 exceptions

```

</details>
